# GetSolarHeatGainCoefficientsForSolarIndicientAngles Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
EnergyAnalysisWindowType..::..GetSolarHeatGainCoefficientsForSolarIndicientAngles Method
EnergyAnalysisWindowType Class See Also
---
Returns a map with solar heat gain coefficients (SHGC-values) for specific incident angles for the window type.
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2024
# Syntax
C#
---
```text
public IDictionary<double, double> GetSolarHeatGainCoefficientsForSolarIndicientAngles()
```

Visual Basic
---
```text
Public Function GetSolarHeatGainCoefficientsForSolarIndicientAngles As IDictionary(Of Double, Double)
```

Visual C++
---
```text
public:
IDictionary<double, double>^ GetSolarHeatGainCoefficientsForSolarIndicientAngles()
```

# See Also
EnergyAnalysisWindowType Class
Autodesk.Revit.DB.Analysis Namespace